"""
Написать функцию num_translate(), переводящую числительные от 0 до 10 c английского на русский язык. Например:
>>> num_translate("one")
"один"
>>> num_translate("eight")
"восемь"
Если перевод сделать невозможно, вернуть None. Подумайте, как и где лучше хранить информацию, необходимую для перевода:
какой тип данных выбрать, в теле функции или снаружи.
"""
# glossary = {
#     'one': 'один',
#     'two': 'два',
#     'three': 'три',
#     'four': 'четыре',
#     'five': 'пять',
#     'six': 'шесть',
#     'seven': 'семь',
#     'eight': 'восемь',
#     'nine': 'девять',
#     'ten': 'десять'
# }


def num_translate(word):
    """Фунция переводит числительные от 0 до 10 c английского на русский язык, например "one" =>> "один" """
    glossary = {
        'one': 'один',
        'two': 'два',
        'three': 'три',
        'four': 'четыре',
        'five': 'пять',
        'six': 'шесть',
        'seven': 'семь',
        'eight': 'восемь',
        'nine': 'девять',
        'ten': 'десять'
    }
    for key in glossary:
        if word == key:
            return glossary[key]
    else:
        return None


print(num_translate('five'))
